eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
void RTC_IRAM_ATTR esp_wake_deep_sleep() {
  esp_default_wake_deep_sleep();
  laserActive = true;
  relayActive = true;
  digitalWrite(outputPin, HIGH);
  digitalWrite(relayPin, HIGH);
}

/**
 * @brief Generates a unique device ID from the ESP32's MAC address.
 * @return A String representing the unique chip ID.
 */
String getChipId() {
    uint64_t chipid = ESP.getEfuseMac();
    char chipid_str[17];
    snprintf(chipid_str, sizeof(chipid_str), "%04X%08X", (uint16_t)(chipid >> 32), (uint32_t)chipid);
    return String(chipid_str);
}

// Forward declarations for functions called in webSocketEvent
void turnLaserOn();
void turnLaserOff();
void sendSystemConfig(); // Forward declaration for our new function
void addTimeSlot(String startTimeStr, String stopTimeStr); // Ensure it's declared if not already before webSocketEvent
void deleteTimeSlot(int indexToDelete); // Ensure it's declared
void updateDisplay(); // Forward declaration for OLED update


/**
 * @brief Handles events from the WebSocket client.
 *
 * This function is called by the WebSocketsClient library when various events occur,
 * such as connection, disconnection, or when a message is received.
 *
 * @param type The type of WebSocket event that occurred.
 * @param payload A pointer to the data payload associated with the event (if any).
 * @param length The length of the payload.
 */
void webSocketEvent(WStype_t type, uint8_t * payload, size_t length) {
    // Add a Serial.printf at the top to see ALL event types coming in
    // Serial.printf("[WSc] Event Type Received: %d\n", type);

    switch(type) {
        case WStype_DISCONNECTED:
            Serial.printf("[WSc] Event: WStype_DISCONNECTED\n");
            webSocketConnected = false;
            break;
        case WStype_CONNECTED:
            Serial.printf("[WSc] Event: WStype_CONNECTED to %s\n", (char*)payload);
            webSocketConnected = true;
            // Send pairing message
            {
                StaticJsonDocument<200> doc;
                doc["type"] = "pairing";
                doc["deviceId"] = deviceId;
                String output;
                serializeJson(doc, output);
                webSocket.sendTXT(output);
                Serial.println("Sent pairing message: " + output);
                Serial.println("[DEBUG] Calling sendSystemConfig on WebSocket connect.");
                sendSystemConfig(); // Send initial system config on connect
            }
            break;
        case WStype_TEXT:
            Serial.printf("[WSc] Event: WStype_TEXT\n"); // Log that we entered TEXT handling
            Serial.printf("[WSc] Raw payload received (for WStype_TEXT): %s\n", (char*)payload); // Moved from top of TEXT block
            Serial.printf("[WSc] Payload length (for WStype_TEXT): %u\n", length);    // Moved from top of TEXT block
            // The old "[WSc] get text:" log is redundant if "Raw payload received" is here.

            // Existing code follows
            {
                StaticJsonDocument<384> doc; // Ensure this size is appropriate, 384 should be fine for this command
                DeserializationError error = deserializeJson(doc, payload, length);
                if (error) {
                    Serial.print(F("deserializeJson() failed: "));
                    Serial.println(error.f_str());
                    return;
                }

                // Main command processing path:
                if (doc.containsKey("command")) {
                    const char* command = doc["command"];
                    Serial.printf("[DEBUG] Received standard command: %s\n", command);

                    if (strcmp(command, "addTimer_value") == 0) { // New handler
                        Serial.println("[DEBUG] Received 'addTimer_value' command.");
                        const char* dataStr = doc["value"]; // Expect data in "value" field
                        if (dataStr) {
                            String combinedData = String(dataStr);
                            int semicolonIndex = combinedData.indexOf(';');
                            if (semicolonIndex > 0 && semicolonIndex < combinedData.length() - 1) {
                                String startTimeFromData = combinedData.substring(0, semicolonIndex);
                                String endTimeFromData = combinedData.substring(semicolonIndex + 1);
                                Serial.printf("[DEBUG] Parsed from 'value' string -> startTime: %s, endTime: %s\n", startTimeFromData.c_str(), endTimeFromData.c_str());
                                addTimeSlot(startTimeFromData, endTimeFromData);
                            } else {
                                Serial.println("[DEBUG] 'addTimer_value' invalid 'value' field format. Expected 'HH:MM;HH:MM'.");
                            }
                        } else {
                            Serial.println("[DEBUG] 'addTimer_value' missing 'value' field.");
                        }
                        sendSystemConfig(); // Update client
                    } // <<< ****** ADDED MISSING CLOSING BRACE HERE ******
                    // Deprecated addTimer handlers fully removed.
                    // Standard commands:
                    else if (strcmp(command, "servoX") == 0) {
                        int val = doc["value"];
                        myservoX.write(val);
                        valueStringX = String(val);
                        Serial.printf("Executed servoX: %d\n", val);
                    } else if (strcmp(command, "servoY") == 0) {
                        int val = doc["value"];
                        myservoY.write(val);
                        valueStringY = String(val);
                        Serial.printf("Executed servoY: %d\n", val);
                    } else if (strcmp(command, "LASER_ON") == 0) {
                        turnLaserOn();
                        Serial.println("Executed LASER_ON");
                    } else if (strcmp(command, "LASER_OFF") == 0) {
                        turnLaserOff();
                        Serial.println("Executed LASER_OFF");
                    } else if (strcmp(command, "RELAY_ON") == 0) {
                        digitalWrite(relayPin, HIGH);
                        relayActive = true;
                        Serial.println("Executed RELAY_ON");
                    } else if (strcmp(command, "RELAY_OFF") == 0) {
                        digitalWrite(relayPin, LOW);
                        relayActive = false;
                        Serial.println("Executed RELAY_OFF");
                    } else if (strcmp(command, "RANDOM_MOTION_TOGGLE") == 0) {
                        randomMotionActive = !randomMotionActive;
                        Serial.printf("Random motion toggled: %s\n", randomMotionActive ? "ON" : "OFF");
                        sendSystemConfig(); // Send feedback for UI update
                    }
                    // Commands for ESP32CAM
                    else if (strcmp(command, "START_STREAM") == 0) {
                        Serial2.println("START_STREAM");
                        Serial.println("Sent command to ESP32CAM: START_STREAM");
                        streaming = true;
                    } else if (strcmp(command, "STOP_STREAM") == 0) {
                        Serial2.println("STOP_STREAM");
                        Serial.println("Sent command to ESP32CAM: STOP_STREAM");
                        streaming = false;
                    } else if (strcmp(command, "CAM_LED_ON") == 0) {
                        Serial2.println("LED_ON");
                        Serial.println("Sent command to ESP32CAM: LED_ON");
                        camLedActive = true;
                    } else if (strcmp(command, "CAM_LED_OFF") == 0) {
                        Serial2.println("LED_OFF");
                        Serial.println("Sent command to ESP32CAM: LED_OFF");
                        camLedActive = false;
                    } else if (strcmp(command, "getSystemConfig") == 0) {
                        Serial.println("[DEBUG] Received 'getSystemConfig' command.");
                        Serial.println("[DEBUG] Calling sendSystemConfig for getSystemConfig command.");
                        sendSystemConfig();
                    } else if (strcmp(command, "setServoLimit") == 0) {
                        const char* axis = doc["axis"];
                        const char* limit_type = doc["limit_type"];
                        int value = doc["value"]; // Assuming value is passed as int
                        if (axis && limit_type) { // Basic null check
                            Serial.printf("Received setServoLimit: axis=%s, type=%s, value=%d\n", axis, limit_type, value);
                            preferences.begin("servo_config", false);
                            if (strcmp(axis, "x") == 0 && strcmp(limit_type, "min") == 0) { minX = value; preferences.putInt("min_x", minX); }
                            else if (strcmp(axis, "x") == 0 && strcmp(limit_type, "max") == 0) { maxX = value; preferences.putInt("max_x", maxX); }
                            else if (strcmp(axis, "y") == 0 && strcmp(limit_type, "min") == 0) { minY = value; preferences.putInt("min_y", minY); }
                            else if (strcmp(axis, "y") == 0 && strcmp(limit_type, "max") == 0) { maxY = value; preferences.putInt("max_y", maxY); }
                            preferences.end();
                            Serial.printf("Updated limits: minX=%d, maxX=%d, minY=%d, maxY=%d\n", minX, maxX, minY, maxY);
                            sendSystemConfig(); // Send updated config
                        } else {
                             Serial.println("[ERROR] setServoLimit: missing axis or limit_type.");
                        }
                    }
                    else if (strcmp(command, "deleteTimer") == 0) {
                        int timerIndex = doc["timerIndex"];
                        Serial.printf("Received deleteTimer: index=%d\n", timerIndex);
                        deleteTimeSlot(timerIndex);
                        sendSystemConfig();
                    } else if (strcmp(command, "setPreference") == 0) {
                        const char* key = doc["key"];
                        if (key) {
                            preferences.begin("servo_config", false);
                            bool preferenceChanged = false;
                            if (strcmp(key, "min_x") == 0) { minX = doc["value"].as<int>(); preferences.putInt("min_x", minX); preferenceChanged = true; }
                            else if (strcmp(key, "max_x") == 0) { maxX = doc["value"].as<int>(); preferences.putInt("max_x", maxX); preferenceChanged = true; }
                            else if (strcmp(key, "min_y") == 0) { minY = doc["value"].as<int>(); preferences.putInt("min_y", minY); preferenceChanged = true; }
                            else if (strcmp(key, "max_y") == 0) { maxY = doc["value"].as<int>(); preferences.putInt("max_y", maxY); preferenceChanged = true; }
                            else if (strcmp(key, "min_vel") == 0) { minVel = doc["value"].as<int>(); preferences.putInt("min_vel", minVel); preferenceChanged = true; }
                            else if (strcmp(key, "max_vel") == 0) { maxVel = doc["value"].as<int>(); preferences.putInt("max_vel", maxVel); preferenceChanged = true; }
                            // Removed obsolete 'timezone' (integer offset) case
                            else if (strcmp(key, "timezone_posix") == 0) {
                                timeZonePosixString = doc["value"].as<String>();
                                preferences.putString("tz_posix", timeZonePosixString);

                                // Set the Timezone environment variable
                                Serial.printf("[WSc] Setting TZ environment variable to: %s\n", timeZonePosixString.c_str());
                                setenv("TZ", timeZonePosixString.c_str(), 1);
                                tzset(); // Apply the TZ setting

                                // Re-configure system time with NTP server. Offsets are 0 as TZ env var handles it.
                                // configTime(0, 0, "pool.ntp.org"); // Not strictly necessary to call this again if NTP servers haven't changed
                                                                    // and if sntp is already running. tzset() is the key.
                                Serial.printf("[WSc] System TZ updated. Current NTP server 'pool.ntp.org'. TZ set by environment: %s\n", timeZonePosixString.c_str());

                                timeClient.setTimeOffset(0); // Ensure NTPClient knows its offset is 0 relative to system time

                                Serial.println("[WSc] Attempting to update NTP time immediately after timezone change...");
                                if (timeClient.update()) {
                                   Serial.println("[WSc] NTP time updated successfully after timezone change.");
                                } else {
                                   Serial.println("[WSc] NTP time update failed after timezone change. Will retry on next interval.");
                                }
                                lastNTPUpdateTime = millis(); // Reset NTP update timer to force update sooner if configured interval is long
                                preferenceChanged = true;
                                Serial.printf("[WSc] Timezone POSIX string updated to: %s and applied.\n", timeZonePosixString.c_str());
                                updateDisplay(); // Force OLED update to reflect new time immediately
                            }
                            else if (strcmp(key, "ntp_interval") == 0) {
                                ntpUpdateInterval = doc["value"].as<long>(); // Value is in ms from web UI
                                preferences.putLong("ntp_interval", ntpUpdateInterval);
                                // NTPClient doesn't have a setUpdateInterval method after begin.
                                // The new interval will be used on the next check in loop().
                                preferenceChanged = true;
                            }
                            else { Serial.printf("[WSc] Unknown preference key: %s\n", key); }

                            if (preferenceChanged) {
                                Serial.printf("[WSc] Preference updated: %s = %s\n", key, doc["value"].as<String>().c_str());
                                preferences.end();
                                sendSystemConfig(); // Send updated config to all clients
                            } else {
                                preferences.end(); // Still need to end if no known key matched
                            }
                        } else {
                            Serial.println("[WSc] setPreference command missing 'key'.");
                        }
                    }
                    else {
                        Serial.printf("[DEBUG] Unknown standard command: %s\n", command);
                    }
                } else {
                    Serial.println("[WSc] Received JSON without 'command' key (and not hyper-simplified 'c':'at').");
                }
            }
            break;
        case WStype_BIN:
            Serial.printf("[WSc] get binary length: %u\n", length);
            // hexdump(payload, length); // Example if needed
            break;
        case WStype_ERROR:
            Serial.printf("[WSc] Event: WStype_ERROR - error: %s\n", (char*)payload);
            webSocketConnected = false;
            break;

        // ADD OR MODIFY THESE CASES FOR FRAGMENTATION LOGGING:
        case WStype_FRAGMENT_TEXT_START:
            Serial.printf("[WSc] Event: WStype_FRAGMENT_TEXT_START\n");
            break;
        case WStype_FRAGMENT_BIN_START:
            Serial.printf("[WSc] Event: WStype_FRAGMENT_BIN_START\n");
            break;
        case WStype_FRAGMENT:
            Serial.printf("[WSc] Event: WStype_FRAGMENT - Current fragment length: %u\n", length);
            // Avoid printing payload here unless sure it's text and null-terminated or handled carefully,
            // as fragments are not necessarily complete messages.
            // For debugging, if you know it's text and want a peek:
            // if (length > 0 && payload) {
            //    char buf[33]; // Print up to 32 chars + null terminator
            //    memcpy(buf, payload, length < 32 ? length : 32);
            //    buf[length < 32 ? length : 32] = '\0'; // Ensure null termination
            //    Serial.printf("[WSc] Fragment Data Peek: %s\n", buf);
            // }
            break;
        case WStype_FRAGMENT_FIN:
            Serial.printf("[WSc] Event: WStype_FRAGMENT_FIN - Final fragment length: %u\n", length);
            // After this, the library should internally reassemble and then issue a WStype_TEXT or WStype_BIN event
            // with the complete payload.
            break;

        default:
            Serial.printf("[WSc] Event: Unknown WStype_t: %d\n", type);
            break;
    }
}

void saveWifiCallback() {
  Serial.println("WiFi credentials saved");
  wifiConnectedAP = true;
  staSSID = WiFi.SSID();
  staPassword = WiFi.psk();
}

// Function to get formatted time
String getFormattedTime() {
  return timeClient.getFormattedTime();
}

int timeToMinutes(String formattedTime) {
  // Basic validation for HH:MM format
  if (formattedTime.length() != 5 || formattedTime.charAt(2) != ':') {
    Serial.println("Invalid time format for timeToMinutes: " + formattedTime);
    return -1; // Indicate error
  }
  int hours = formattedTime.substring(0, 2).toInt();
  int minutes = formattedTime.substring(3, 5).toInt();
  if (hours < 0 || hours > 23 || minutes < 0 || minutes > 59) {
    Serial.println("Invalid time value for timeToMinutes: " + formattedTime);
    return -1; // Indicate error
  }
  return hours * 60 + minutes;
}

String minutesToTime(int totalMinutes) {
  if (totalMinutes < 0 || totalMinutes >= (24 * 60)) { // Check if totalMinutes is outside 0-1439 range
    // Serial.printf("Invalid totalMinutes value for minutesToTime: %d\n", totalMinutes); // Optional: Log this
    return "N/A"; // Or some other indicator of invalid time
  }
  int hours = (totalMinutes / 60) % 24;
  int minutes = totalMinutes % 60;
  return String(hours < 10 ? "0" : "") + String(hours) + ":" + String(minutes < 10 ? "0" : "") + String(minutes);
}

/** @brief Turns the laser connected to outputPin ON. */
void turnLaserOn() {
  digitalWrite(outputPin, HIGH);
}

/** @brief Turns the laser connected to outputPin OFF. */
void turnLaserOff() {
  digitalWrite(outputPin, LOW);
}

