eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
  bool shouldMoveRandomlyThisCycle = false;
  String scheduledStartTime = ""; // Local variables to store the times
  String scheduledStopTime = "";

  if (timeClient.isTimeSet()) {
    String fullTime = getFormattedTime(); // This is HH:MM:SS
    String currentTimeForLogic = fullTime.substring(0, 5); // Should be HH:MM

    // Ensure NTP debug log is commented or removed
    // Serial.printf("[DEBUG] Full NTP time: %s, Truncated for logic: %s\n", fullTime.c_str(), currentTimeForLogic.c_str());

    int currentMinutes = timeToMinutes(currentTimeForLogic);

    if (currentMinutes == -1) { // timeToMinutes might return -1 if time is not set or format is wrong
        Serial.println("Cannot check schedule, current time is invalid.");
    } else {
        for (int i = 0; i < numTimeSlots; i++) {
            // Explicitly skip if timer slot data is invalid (should be ensured by loading logic too)
            if (timeSlots[i].startTimeMinutes == -1 || timeSlots[i].stopTimeMinutes == -1) {
                continue;
            }

            // Check if current time falls within this time slot
            if (timeSlots[i].startTimeMinutes < timeSlots[i].stopTimeMinutes) { // Normal case (e.g., 10:00 - 12:00)
                if (currentMinutes >= timeSlots[i].startTimeMinutes && currentMinutes < timeSlots[i].stopTimeMinutes) {
                    shouldMoveRandomlyThisCycle = true;
                    scheduledStartTime = minutesToTime(timeSlots[i].startTimeMinutes);
                    scheduledStopTime = minutesToTime(timeSlots[i].stopTimeMinutes);
                    break;
                }
            } else { // Overnight case (e.g., 22:00 - 02:00)
                if (currentMinutes >= timeSlots[i].startTimeMinutes || currentMinutes < timeSlots[i].stopTimeMinutes) {
                    shouldMoveRandomlyThisCycle = true;
                    scheduledStartTime = minutesToTime(timeSlots[i].startTimeMinutes);
                    scheduledStopTime = minutesToTime(timeSlots[i].stopTimeMinutes);
                    break;
                }
            }
        }
    }
  }

  isScheduledMovementActive = shouldMoveRandomlyThisCycle; // Update the global state
  if (isScheduledMovementActive) {
    // Ensure that currentScheduleStartTime and currentScheduleStopTime are not "N/A" before using them
    if (scheduledStartTime != "N/A" && scheduledStopTime != "N/A") {
        currentScheduleStartTime = scheduledStartTime; // Update the global start time
        currentScheduleStopTime = scheduledStopTime;   // Update the global stop time
        turnLaserOn();
    } else {
        // This case should ideally not be reached if shouldMoveRandomlyThisCycle is true
        // because minutesToTime should have provided valid strings.
        // But as a safeguard:
        isScheduledMovementActive = false; // Correct the state if times are N/A
        currentScheduleStartTime = "";
        currentScheduleStopTime = "";
    }
  } else {
    currentScheduleStartTime = ""; // Clear the global start time when no schedule is active
    currentScheduleStopTime = "";   // Clear the global stop time when no schedule is active
  }

  // Call random movement if the schedule says it should AND it's not overridden, OR if the button is toggled ON
  if ((isScheduledMovementActive && !scheduledMovementOverridden) || randomMotionActive) { // isScheduledMovementActive is now more robust
    moveServosRandomlyNonBlocking(); // Call the non-blocking random movement function
    if (laserActive) turnLaserOn(); // Consider if laserActive should gate this
  } else {
    // Only turn laser off if not in configuration AND no manual override keeps it on
    // Assuming laserActive is the override/manual state.
    if (!inConfiguration && laserActive) { turnLaserOff(); }
    else if (!inConfiguration && !laserActive) { /* already off */ }
    else if (inConfiguration && laserActive) { /* keep on during config if it was on */ }
  }

  updateServoMovement(myservoX, movementX); // Update X servo movement
  updateServoMovement(myservoY, movementY); // Update Y servo movement
// The following block seems to be a repetition of the logic above for `isScheduledMovementActive` and `currentScheduleStart/StopTime`
// It should be removed to avoid redundancy and potential conflicts.
// The state of isScheduledMovementActive, currentScheduleStartTime, and currentScheduleStopTime
// is already correctly determined by the preceding block.

  // (Repetitive block removed)

  if (settingsMode) {
    displaySettings();
  } else {
    updateDisplay();
  }

  // Status Sending Logic
  static unsigned long lastStatusUpdateTime = 0;
  unsigned long statusUpdateInterval = 10000; // Send status every 10 seconds

  if (webSocketConnected && (millis() - lastStatusUpdateTime > statusUpdateInterval)) {
    lastStatusUpdateTime = millis();
    StaticJsonDocument<512> doc; // Increased size for more status data
    doc["type"] = "statusUpdate";
    // No need to send deviceId, server knows it from connection object

    JsonObject data = doc.createNestedObject("data");
    data["uptime_ms"] = millis();
    data["wifi_rssi"] = WiFi.RSSI();
    data["servoX_pos"] = myservoX.read();
    data["servoY_pos"] = myservoY.read();
    data["laser_active"] = digitalRead(outputPin) == HIGH;
    data["relay_active"] = relayActive; // relayActive is updated by RELAY_ON/OFF commands
    data["random_motion_active"] = randomMotionActive;
    data["is_scheduled_movement_active"] = isScheduledMovementActive;
    data["esp32cam_connected"] = esp32CamConnected;
    data["esp32cam_streaming"] = streaming;
    data["cam_led_active"] = camLedActive; // Include CAM LED state
    // Add servo limits to status update
    data["minX"] = minX;
    data["maxX"] = maxX;
    data["minY"] = minY;
    data["maxY"] = maxY;
    // Add other relevant status data

    String output;
    serializeJson(doc, output);
    webSocket.sendTXT(output);
    Serial.println("Sent status update: " + output);
  }

